--[[
-- Дополнить нормальными комментариями, какой цвет что обозначает и где 
-- появляется.
--]]
local pallete = {
    active = {1, 1, 1, 1},
    --inactive = {0.89, 0.40, 0.99, 1},
    inactive = {0.2, 0.75, 0.5, 1},
    highLightedTextColor = {0.78, 0.78, 0.78, 1},

    --background = {20 / 255, 40 / 255, 80 / 255, 1},
    --background = {0.2, 0.2, 0.2},
    background = {0.3, 0.3, 0.2, 0.5},
    chart = {200 / 255, 80 / 255, 80 / 255, 1},
    --field = {20 / 255, 80 / 255, 80 / 255, 1},
    field = {0.3, 0.8, 0.8, 1},
    font = {255 / 255, 255 / 255, 255 / 255, 1},
    header = {1, 1, 0},
    scroll_tip_text = {0 / 255, 240 / 255, 0 / 255, 1},
    signal = {200 / 255, 80 / 255, 80 / 255, 1},

    sound_text_disabled = {255 / 255, 255 / 255, 0 / 255, 1},
    sound_text_enabled = {0 / 255, 240 / 255, 0 / 255, 1},

    statistic = {0 / 255, 240 / 255, 0 / 255, 1},
    percentFont = {200 / 255, 0, 200 / 255},

    tip_text_alt = {255 / 255, 255 / 255, 0 / 255, 1},
    tip_text = {0 / 255, 240 / 255, 0 / 255, 1},

    debug_line = {100 / 255, 200 / 255, 50 / 255, 1},
    debug_font = {140 / 255, 140 / 255, 140 / 255, 1},
    hit_color = {200 / 255, 10 / 255, 10 / 255},
    buttonColor = {1, 0.42, 0.5},
    statisticSignalType = {0, 0.941, 0, 1},

    -- уровень сложности растет - цвет меняется от зеленого к красному
    levelColors = { {0, 1, 0.5}, {0, 10, 0.276}, {0, 1, 0.34},
        {0.44, 1, 0}, {0.84, 1, 0}, {1, 0.573, 0}, {1, 0.22, 0} },
    pviewer = {
        scrollTriangle = {0.8, 0.1, 0.2},
        -- текст с временем прошедщих игр в просмотрщике прогресса
        itemText = {0, 0, 0},
        -- если уровень сложности не распознается
        unknown = {0.5, 0.5, 0.5},
        -- полоска скороллинга слева
        scrollLine = {0, 0, 0},
        -- кружок на полоске скроллинга
        circle = {1, 0, 0},
    },
    selectedLanguage = {1, 0.3, 0.2},
}

return pallete
